### Forest: Snapshot Service Infrastructure Plan: success

<details><summary>Show Plan</summary>

```
data.local_file.init: Reading...%0Adata.external.sources_tar: Reading...%0Adata.local_file.init: Read complete after 0s [id=6c33e49974387292c0336588b86d24ceec3c19e1]%0Adata.digitalocean_project.forest_project: Reading...%0Adata.digitalocean_ssh_keys.keys: Reading...%0Adata.external.sources_tar: Read complete after 0s [id=-]%0Adata.local_file.sources: Reading...%0Adata.local_file.sources: Read complete after 0s [id=096c95f2fce182223339080588340bd394927aba]%0Adata.digitalocean_ssh_keys.keys: Read complete after 1s [id=ssh_keys/14512061520513425405]%0Adata.digitalocean_project.forest_project: Read complete after 2s [id=da5e6601-7fd9-4d02-951e-390f7feb3411]%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A%0ATerraform will perform the following actions:%0A%0A  # digitalocean_droplet.forest will be created%0A  + resource "digitalocean_droplet" "forest" {%0A      + backups              = false%0A      + created_at           = (known after apply)%0A      + disk                 = (known after apply)%0A      + graceful_shutdown    = false%0A      + id                   = (known after apply)%0A      + image                = "docker-20-04"%0A      + ipv4_address         = (known after apply)%0A      + ipv4_address_private = (known after apply)%0A      + ipv6                 = false%0A      + ipv6_address         = (known after apply)%0A      + locked               = (known after apply)%0A      + memory               = (known after apply)%0A      + monitoring           = true%0A      + name                 = "prod-forest-snapshot"%0A      + price_hourly         = (known after apply)%0A      + price_monthly        = (known after apply)%0A      + private_networking   = (known after apply)%0A      + region               = "fra1"%0A      + resize_disk          = true%0A      + size                 = "s-4vcpu-16gb-amd"%0A      + ssh_keys             = [%0A          + "00:a0:c0:54:5f:40:22:10:52:8a:04:48:f9:c8:db:00",%0A          + "04:77:74:e8:81:92:9d:1e:cb:d3:5d:0d:fa:83:56:f6",%0A          + "31:fd:e9:da:70:df:ef:33:af:a2:ea:a1:fd:69:a7:9d",%0A          + "37:1e:1a:fc:25:2d:5a:a7:1f:49:b2:6d:53:5c:0e:45",%0A          + "41:91:6d:f9:f7:27:44:30:7f:a4:6f:36:e8:97:ad:cb",%0A          + "5a:a8:6d:02:66:21:e9:f7:27:b2:1c:6e:89:0f:65:77",%0A          + "5f:d6:ad:06:b8:2d:4a:ef:0a:ac:97:bf:37:b0:7a:4c",%0A          + "77:09:d9:32:61:65:81:08:d1:e2:50:9b:ec:28:02:62",%0A          + "88:95:97:77:a1:1f:bf:e8:3a:84:20:7d:a9:4c:74:6d",%0A          + "99:ea:ec:bf:9f:d1:b2:52:02:b2:78:a2:57:25:a0:e7",%0A          + "9c:18:88:44:c4:d6:74:84:07:9a:3c:9a:f6:17:f3:e4",%0A          + "b6:03:52:e0:49:14:03:90:19:37:69:c3:c7:d0:e7:69",%0A          + "bb:7a:cc:18:56:7a:cb:2b:07:d7:8b:30:86:b8:b5:41",%0A          + "c7:f9:b0:49:24:aa:30:36:4e:5f:d4:a3:ab:43:49:e8",%0A          + "d3:6d:af:8e:a4:b9:8f:b8:38:2b:56:06:5f:38:48:a7",%0A          + "e4:0e:85:24:75:5e:f3:b1:77:c4:7d:a2:3a:1e:00:b1",%0A          + "f7:de:2d:83:ce:e7:c3:13:2c:ca:3a:f0:4b:4e:46:da",%0A          + "fa:48:60:7b:b0:c4:86:70:e9:fa:e9:f8:fb:c7:2e:72",%0A          + "fa:62:10:64:1b:77:eb:78:a5:ba:e0:86:ff:76:7e:97",%0A          + "fe:42:94:20:d0:a9:24:67:5f:de:78:c1:bb:8b:6c:92",%0A        ]%0A      + status               = (known after apply)%0A      + tags                 = [%0A          + "iac",%0A          + "prod",%0A        ]%0A      + urn                  = (known after apply)%0A      + user_data            = (sensitive value)%0A      + vcpus                = (known after apply)%0A      + volume_ids           = (known after apply)%0A      + vpc_uuid             = (known after apply)%0A    }%0A%0A  # digitalocean_firewall.forest-firewall will be created%0A  + resource "digitalocean_firewall" "forest-firewall" {%0A      + created_at      = (known after apply)%0A      + droplet_ids     = (known after apply)%0A      + id              = (known after apply)%0A      + name            = "prod-forest-snapshot"%0A      + pending_changes = (known after apply)%0A      + status          = (known after apply)%0A%0A      + inbound_rule {%0A          + port_range                = "22"%0A          + protocol                  = "tcp"%0A          + source_addresses          = [%0A              + "0.0.0.0/0",%0A              + "::/0",%0A            ]%0A          + source_droplet_ids        = []%0A          + source_kubernetes_ids     = []%0A          + source_load_balancer_uids = []%0A          + source_tags               = []%0A        }%0A      + inbound_rule {%0A          + port_range                = "2345"%0A          + protocol                  = "tcp"%0A          + source_addresses          = [%0A              + "0.0.0.0/0",%0A              + "::/0",%0A            ]%0A          + source_droplet_ids        = []%0A          + source_kubernetes_ids     = []%0A          + source_load_balancer_uids = []%0A          + source_tags               = []%0A        }%0A      + inbound_rule {%0A          + port_range                = "53"%0A          + protocol                  = "udp"%0A          + source_addresses          = [%0A              + "0.0.0.0/0",%0A              + "::/0",%0A            ]%0A          + source_droplet_ids        = []%0A          + source_kubernetes_ids     = []%0A          + source_load_balancer_uids = []%0A          + source_tags               = []%0A        }%0A      + inbound_rule {%0A          + port_range                = "80"%0A          + protocol                  = "tcp"%0A          + source_addresses          = [%0A              + "0.0.0.0/0",%0A              + "::/0",%0A            ]%0A          + source_droplet_ids        = []%0A          + source_kubernetes_ids     = []%0A          + source_load_balancer_uids = []%0A          + source_tags               = []%0A        }%0A%0A      + outbound_rule {%0A          + destination_addresses          = [%0A              + "0.0.0.0/0",%0A              + "::/0",%0A            ]%0A          + destination_droplet_ids        = []%0A          + destination_kubernetes_ids     = []%0A          + destination_load_balancer_uids = []%0A          + destination_tags               = []%0A          + port_range                     = "53"%0A          + protocol                       = "udp"%0A        }%0A      + outbound_rule {%0A          + destination_addresses          = [%0A              + "0.0.0.0/0",%0A              + "::/0",%0A            ]%0A          + destination_droplet_ids        = []%0A          + destination_kubernetes_ids     = []%0A          + destination_load_balancer_uids = []%0A          + destination_tags               = []%0A          + port_range                     = "all"%0A          + protocol                       = "tcp"%0A        }%0A    }%0A%0A  # digitalocean_project_resources.connect_forest_project will be created%0A  + resource "digitalocean_project_resources" "connect_forest_project" {%0A      + id        = (known after apply)%0A      + project   = "da5e6601-7fd9-4d02-951e-390f7feb3411"%0A      + resources = (known after apply)%0A    }%0A%0A  # module.monitoring[0].newrelic_alert_policy.alert will be created%0A  + resource "newrelic_alert_policy" "alert" {%0A      + account_id          = (known after apply)%0A      + id                  = (known after apply)%0A      + incident_preference = "PER_POLICY"%0A      + name                = "prod-forest-snapshot alert policy"%0A    }%0A%0A  # module.monitoring[0].newrelic_events_to_metrics_rule.generate_snapshot_attempt_metrics["calibnet"] will be created%0A  + resource "newrelic_events_to_metrics_rule" "generate_snapshot_attempt_metrics" {%0A      + account_id  = (sensitive value)%0A      + description = "Snapshot generation attempts"%0A      + id          = (known after apply)%0A      + name        = "prod-forest-snapshot calibnet snapshot generation attempts"%0A      + nrql        = "From Log select uniqueCount(message) as 'prod-forest-snapshot.calibnet.snapshot_generation_run' WHERE `hostname` = 'prod-forest-snapshot' AND filePath ='/root/logs/calibnet_log.txt' AND message LIKE '%25running snapshot export%25'"%0A      + rule_id     = (known after apply)%0A    }%0A%0A  # module.monitoring[0].newrelic_events_to_metrics_rule.generate_snapshot_attempt_metrics["mainnet"] will be created%0A  + resource "newrelic_events_to_metrics_rule" "generate_snapshot_attempt_metrics" {%0A      + account_id  = (sensitive value)%0A      + description = "Snapshot generation attempts"%0A      + id          = (known after apply)%0A      + name        = "prod-forest-snapshot mainnet snapshot generation attempts"%0A      + nrql        = "From Log select uniqueCount(message) as 'prod-forest-snapshot.mainnet.snapshot_generation_run' WHERE `hostname` = 'prod-forest-snapshot' AND filePath ='/root/logs/mainnet_log.txt' AND message LIKE '%25running snapshot export%25'"%0A      + rule_id     = (known after apply)%0A    }%0A%0A  # module.monitoring[0].newrelic_events_to_metrics_rule.generate_snapshot_fail_metrics["calibnet"] will be created%0A  + resource "newrelic_events_to_metrics_rule" "generate_snapshot_fail_metrics" {%0A      + account_id  = (sensitive value)%0A      + description = "Failed snapshot generations"%0A      + id          = (known after apply)%0A      + name        = "prod-forest-snapshot calibnet snapshot generation failure"%0A      + nrql        = "From Log select uniqueCount(message) as 'prod-forest-snapshot.calibnet.snapshot_generation_fail' WHERE `hostname` = 'prod-forest-snapshot' AND filePath ='/root/logs/calibnet_log.txt' AND message LIKE '%25Snapshot upload failed for%25'"%0A      + rule_id     = (known after apply)%0A    }%0A%0A  # module.monitoring[0].newrelic_events_to_metrics_rule.generate_snapshot_fail_metrics["mainnet"] will be created%0A  + resource "newrelic_events_to_metrics_rule" "generate_snapshot_fail_metrics" {%0A      + account_id  = (sensitive value)%0A      + description = "Failed snapshot generations"%0A      + id          = (known after apply)%0A      + name        = "prod-forest-snapshot mainnet snapshot generation failure"%0A      + nrql        = "From Log select uniqueCount(message) as 'prod-forest-snapshot.mainnet.snapshot_generation_fail' WHERE `hostname` = 'prod-forest-snapshot' AND filePath ='/root/logs/mainnet_log.txt' AND message LIKE '%25Snapshot upload failed for%25'"%0A      + rule_id     = (known after apply)%0A    }%0A%0A  # module.monitoring[0].newrelic_events_to_metrics_rule.generate_snapshot_success_metrics["calibnet"] will be created%0A  + resource "newrelic_events_to_metrics_rule" "generate_snapshot_success_metrics" {%0A      + account_id  = (sensitive value)%0A      + description = "Success snapshot generations"%0A      + id          = (known after apply)%0A      + name        = "prod-forest-snapshot calibnet snapshot generation success"%0A      + nrql        = "From Log select uniqueCount(message) as 'prod-forest-snapshot.calibnet.snapshot_generation_ok' WHERE `hostname` = 'prod-forest-snapshot' AND filePath ='/root/logs/calibnet_log.txt' AND message LIKE '%25Snapshot uploaded for%25'"%0A      + rule_id     = (known after apply)%0A    }%0A%0A  # module.monitoring[0].newrelic_events_to_metrics_rule.generate_snapshot_success_metrics["mainnet"] will be created%0A  + resource "newrelic_events_to_metrics_rule" "generate_snapshot_success_metrics" {%0A      + account_id  = (sensitive value)%0A      + description = "Success snapshot generations"%0A      + id          = (known after apply)%0A      + name        = "prod-forest-snapshot mainnet snapshot generation success"%0A      + nrql        = "From Log select uniqueCount(message) as 'prod-forest-snapshot.mainnet.snapshot_generation_ok' WHERE `hostname` = 'prod-forest-snapshot' AND filePath ='/root/logs/mainnet_log.txt' AND message LIKE '%25Snapshot uploaded for%25'"%0A      + rule_id     = (known after apply)%0A    }%0A%0A  # module.monitoring[0].newrelic_nrql_alert_condition.snapshot_frequency_condition["calibnet"] will be created%0A  + resource "newrelic_nrql_alert_condition" "snapshot_frequency_condition" {%0A      + account_id                   = (known after apply)%0A      + aggregation_window           = 360%0A      + description                  = "Alert when snapshots are not generated within requried time interval"%0A      + enabled                      = true%0A      + entity_guid                  = (known after apply)%0A      + id                           = (known after apply)%0A      + name                         = "Low snapshot generation frequency - calibnet"%0A      + policy_id                    = (known after apply)%0A      + type                         = "static"%0A      + violation_time_limit         = (known after apply)%0A      + violation_time_limit_seconds = 259200%0A%0A      + critical {%0A          + operator              = "below"%0A          + threshold             = 1%0A          + threshold_duration    = 720%0A          + threshold_occurrences = "all"%0A        }%0A%0A      + nrql {%0A          + query = "FROM Metric SELECT count(`prod-forest-snapshot.calibnet.snapshot_generation_ok`)"%0A        }%0A%0A      + warning {%0A          + operator              = "below"%0A          + threshold             = 1%0A          + threshold_duration    = 360%0A          + threshold_occurrences = "all"%0A        }%0A    }%0A%0A  # module.monitoring[0].newrelic_nrql_alert_condition.snapshot_frequency_condition["mainnet"] will be created%0A  + resource "newrelic_nrql_alert_condition" "snapshot_frequency_condition" {%0A      + account_id                   = (known after apply)%0A      + aggregation_window           = 360%0A      + description                  = "Alert when snapshots are not generated within requried time interval"%0A      + enabled                      = true%0A      + entity_guid                  = (known after apply)%0A      + id                           = (known after apply)%0A      + name                         = "Low snapshot generation frequency - mainnet"%0A      + policy_id                    = (known after apply)%0A      + type                         = "static"%0A      + violation_time_limit         = (known after apply)%0A      + violation_time_limit_seconds = 259200%0A%0A      + critical {%0A          + operator              = "below"%0A          + threshold             = 1%0A          + threshold_duration    = 720%0A          + threshold_occurrences = "all"%0A        }%0A%0A      + nrql {%0A          + query = "FROM Metric SELECT count(`prod-forest-snapshot.mainnet.snapshot_generation_ok`)"%0A        }%0A%0A      + warning {%0A          + operator              = "below"%0A          + threshold             = 1%0A          + threshold_duration    = 360%0A          + threshold_occurrences = "all"%0A        }%0A    }%0A%0APlan: 12 to add, 0 to change, 0 to destroy.%0A%0AChanges to Outputs:%0A  + ip = [%0A      + (known after apply),%0A    ]
```

</details>